[
    {
        "post_title": "Official Weekly Q&A Thread! Ask /r/business_ideas anything you want to know about starting a business or entrepreneurship! Everyone is welcome!",
        "idea": "Virtual Entrepreneurship Mentorship Platform with AI-Powered Q&A and Networking Capabilities",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18alzzs/official_weekly_qa_thread_ask_rbusiness_ideas/",
        "post_content": "Welcome to /r/Business_Ideas!\n\nThis weekly thread is dedicated to all you fast-moving entrepreneurs that may have some quick questions and don't want to deal with posting a thread! We're hoping that as these weekly posts gain popularity, people will be able to get higher quality and faster responses vs posting small threads that take a while to get an answer. \n\nPlease DO NOT solicit/advertise your services here!\n\nWe're always available on the official Discord server: discord.gg/vDjV7h4Qnb"
    },
    {
        "post_title": "Official Weekly Small Business Sunday (SBS) Thread! Feel free to share your product or service with /r/business_ideas and network with others!",
        "idea": "Startup Idea: Business Networking and Ads Platform for Small Business Sundays (SBS) – An online service that connects small business owners to share their products and services, showcase portfolios, and target specific customer types in a weekly virtual event, optimizing networking and advertisement opportunities within the small business community.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/189v9db/official_weekly_small_business_sunday_sbs_thread/",
        "post_content": "Hey /r/Business_Ideas! \n\nWelcome to Small Business Sundays! This is the ONLY place you can solicit on this subreddit, so feel free to plug your business and services here and get the word out about your offerings! \n\nYou should try to include:\n\n* your industry\n* your experience (or portfolio)\n* the type of customer you're looking for\n* any other relevant info"
    },
    {
        "post_title": "I Built a Better Google Trends (Need Testers)",
        "idea": "AI-driven market analysis platform with predictive trends and niche identification capabilities for content creators and marketers.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18eg0mn/i_built_a_better_google_trends_need_testers/",
        "post_content": "I love Google Trends, It's a great way to see the trajectory of keywords.\n\n**However, there are some major flaws**.\n\n1. **No Search Volume -** Google Trends only shows indexed search volume. It doesn't tell you the amount of searches but rather the 0-100 range of where it is now vs it's peak. So if the keyword went from 5 searches to 50 Google Trends would show a 10x, but that's only 45 more searches...\n2. **The Data Isn't Very Helpful -** The \"Related Queries\" section only gives a few related searches. It can be quite random and is rarely insightful.\n3. **It's Not a Discovery Tool -** You have to know what you're searching for. It's tough to get high-quality new ideas based on the one you searched.\n\n**So I fixed that.**\n\nI made a Chrome Extension that lets you enter a vague search into Google Trends and get the actual search volume data.\n\nOn top of that, you will get related trending searches based on the keyword.\n\n**Let me demonstrate**\n\nWith the extension enabled, I entered **\"Skincare Products\"** into Google Trends and it output:\n\n* In the USA the keyword gets 37,281 monthly searches\n* It's up 243%\n* Provided nearly 2,500 related trending searches.\n\n**The trending searches were things like:**\n\n1. Korean Skincare\n2. Retinol\n3. Peptides\n4. Dark Spot Remover\n5. Body Moisturiser\n\nThese are growing products in the skincare niche.\n\nWith this information, you can then go down rabbit holes to find emerging products and brands that consumers are searching for. All without leaving Google Trends.\n\nI also added a feature to quickly link out to Google, Amazon, Meta Ads, and TikTok w/ the data so you can quickly research on those platforms too.\n\nWill be adding an AI function to chat directly with the data and build high-level strategies around the results.\n\n**So what do you think?**\n\n* Does this sound like something you'd use?\n* What kind of features would you like to see?\n* What would you be willing to pay for a tool like this?\n\nIf you want to try out the Chrome Extension you can download and use it for free [here](https://chromewebstore.google.com/detail/trends-playground-google/opaliloakomcdjpoocbcmlckjjkflidd?hl=en-US&utm_source=ext_sidebar)!"
    },
    {
        "post_title": "Where to find regulations of selling spices in the UK",
        "idea": "RegulatoryComplianceHub: An online platform that provides comprehensive regulatory guidelines and filing services for small businesses selling food-related products such as spices and herbs in the UK ensuring they meet all legal requirements for online and offline sales.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18embty/where_to_find_regulations_of_selling_spices_in/",
        "post_content": "Question is in title, there's a certain spice/herb I want to start selling, I'll probably start small on etsy and shopify. However, in the UK, does anyone know the regulations to start selling them? Or where I can find these regulations?"
    },
    {
        "post_title": "Would you use an on-demand audio guide when travelling?",
        "idea": "Interactive Travel Storyteller App with AI-Curated and Professional Audio Tours and Customizable Itineraries",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ei9bu/would_you_use_an_ondemand_audio_guide_when/",
        "post_content": "The idea is that, say you're visiting London, you can purchase the London guide. This London guide lists the attractions that it offers, which includes Buckingham Palace. Once you get to Buckingham Palace, you just click on it to listen to the history and culture of the place (or read the content if you prefer) told in a storytelling manner - not like a wikipedia page being read out to you.\n\nThe website also offers a suggested itinerary, which you can choose to follow or not. \n\nThe content would be two tiered:\n\n1. To keep the cost low (approx. €/$/£5 - €/$/£12 per guide depending on the size of the destination), I would leverage AI to produce the content and then human-edit it. \n2. The premium content (approx. €/$/£40 - €/$/£50) would be created by professionals completely. \n\nWould you use something like this when you're travelling?\n\nIf not, why not?"
    },
    {
        "post_title": "Who wants a website made?",
        "idea": "BuildForReviews: An online platform connecting aspiring web developers with small business owners where the initial website creation is exchanged for genuine reviews and referrals with options for continued site management and support services.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ege7p/who_wants_a_website_made/",
        "post_content": "Im starting my own side business building websites. Im offering a few free initial services which include (meetings, building website and time designing) in exchange for honest reviews to promote my business. The overall cost would be on the cost of buying the website domain and running services on the platform square space. Im looking for small business owners who want to launch a website but don’t know where to start. My ideal client would be someone who would want to continue to manage their website on their own once my services are complete. I will also provide a service that continues to manage your website if needed."
    },
    {
        "post_title": "Have a land",
        "idea": "AgriTourism Glamping Experience with Local Food and Crafts Marketplace",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ec1pm/have_a_land/",
        "post_content": "What can i do on a 3000~ sq ft land to generate some side income monthly.\nNot in central city tho but good connectivity infr and everything also and near some hills."
    },
    {
        "post_title": "Hot tube rooms Business idea",
        "idea": "Themed Hot Tub Retreats with Personalized Relaxation Experiences",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ee6r3/hot_tube_rooms_business_idea/",
        "post_content": "^(What's your opinion about a hot tube themed business?  I have an idea to start a business in my city. The concept is to create a multipurpose space with 5 rooms, each equipped with a hot tubs for up to 4 people. Each room will have a different theme.  For example, one room could have a jungle theme?)"
    },
    {
        "post_title": "1k business ideas?",
        "idea": "Local Errand and Personal Assistance Service targeting busy individuals and elderly who need help with day-to-day tasks and errands.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18dzrm8/1k_business_ideas/",
        "post_content": "I’m looking for a business, or project to invest my post-work hours into. I have around £1000 spare, a car, and a good 8 hours daily available. \n\nMy main issue is indecisiveness I think so I’ll likely just stick to whatever is most upvoted.\n\nI know it’s not a lot to base it off, but I really don’t want to continue things I’ve already started, so for the sake of the post, imagine I have 0 skills to begin with.\n\nThanks."
    },
    {
        "post_title": "Innovative student media platform",
        "idea": "YouthVoice: An interactive multimedia platform designed for and by young individuals for the discussion and dissemination of articles on economics politics and science with a built-in system for collaboration mentorship and skill development in journalism and content creation.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ec9fy/innovative_student_media_platform/",
        "post_content": "Hi, I’m Joe (an undergrad Econ student at Cambridge). I have recently founded a new platform which aims to promote informed discussion by students and young people about important economic, political and scientific developments. We aim to achieve this by providing a student news platform which will increase engagement through new multi-media clarified articles, exclusively youthful authorship and an interactive, collaborative user interface. We’re in the early stages of development so looking for people to join the team either in business management or writing the articles/ creating the content! Message me or reply for more info!"
    },
    {
        "post_title": "What the best way to validate a business idea? How do you go about it?",
        "idea": "Virtual Idea Validation Platform for Entrepreneurs",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ebwbn/what_the_best_way_to_validate_a_business_idea_how/",
        "post_content": " How can you validate a business idea? I often think my ideas are great, but after spending a lot of time on them, building the product, they don't always turn out as expected. What's a way to know if your business idea is good, especially if you don't have direct contact with potential customers at the beginning? "
    },
    {
        "post_title": "Case Study: Startup ShipFast Is Making $55k/Month Four Months After Its Launch",
        "idea": "Startup idea: Launch FastPack - An online platform offering ready-to-use customizable codebases and viral marketing video templates for entrepreneurs to quickly launch and promote their digital startups.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18dl37m/case_study_startup_shipfast_is_making_55kmonth/",
        "post_content": "Hi, it's Peter from  [Dollar Sanity](https://dollarsanity.com/) where we among other things do interviews with successful entrepreneurs. Here's our interview with Marc Lou, a ShipFast founder. \n\n*Marc is a very active redditor -* u/marclouv\n\nMarc is a 30-year-old entrepreneur living in Bali.\n\nHe’s launched 20 startups; most didn’t work out, but 7 did make money. His biggest hit? ShipFast, pulling in about $55,000 a month. Here is how he did it. \n\n## What’s Your Backstory, And How Did You Come Up With The Idea?\n\nI graduated from Computer Science in 2016 and didn’t apply for a job. Instead, I believe I was Mark Zuckerberg and built a secret app for a year. I never launched it. \n\nI felt terrible, so I moved to South Korea and created a VC-backed startup with a friend. We raised $100,000 to predict the price of flight tickets (reverse engineering ticket pricing). It was another flop.\n\nBored of big ideas, I started mini-projects to hopefully make a living on the internet in 2018. I created a SaaS that still pays the bills today after 5 years (about $600/month).\n\nI moved to Bali and kept working on tiny projects but it wasn’t growing. I was making about $1,500 in 2020. \n\nIn late 2021, I discovered Indie Hackers, and my life was transformed. I’ve always felt alone building apps in the dark. Discovering the community of makers who build in public was a big turning point.\n\nIn the last 2 years, I shipped startups like a madman (16 startups). Doing the same thing over and over, I realized I could sell my startup codebase to ship faster. That’s how I created [ShipFast](https://shipfa.st/).\n\nDescribe the process of launching and growing the business.\n\nNow I have over 50,000 followers on Twitter, product launches get more attention but the process is always the same\n\n1. Make a unique launch video, like [this one](https://twitter.com/marc_louvion/status/1723974769593499938).\n\n2. Create a Product Hunt launch\n\n3. On launch day, make a tweet with the video and link to Product Hunt.\n\n4. On launch day, launch everywhere else (Reddit, Indie Hackers, Hackers News). I made some guides for these platforms in [my newsletter](https://marclou.beehiiv.com/). \n\nNothing fancy. Rinse and repeat.\n\n## What Has Worked To Attract New Customers?\n\n1. Viral launch videos like the one above\n\n2. Engineering-as-marketing: free no-signup tools that promote the main product\n\n3. A damn good headline on the landing page\n\nWhat are your plans for the future, and what are you currently working on?\n\nI’m working full-time on [ShipFast](https://shipfa.st/) and [ByeDispute](https://byedispute.com/). I’m also preparing a [course](https://launchvir.al/) to help makers create viral launch videos.\n\n## What Platform/Tools Do You Use For Your Business?\n\nMy $60,000/month solopreneur business costs $183/mo:\n\n– Hosting → Vercel $20/mo  \n– Database → MongoDB $7/mo  \n– Analytics → Plausible $30/mo  \n– Newsletter → Beehiiv $99/mo  \n– Assistant → Co-Pilot $10/mo  \n– Marketing → Twitter + Typefully $17/mo\n\n## Do You Have Any Advice For Other Entrepreneurs Who Are Just Starting Out Or Want To Get Started?\n\n1. Avoid SaaS, subscriptions and free plans\n\n2. Build a very small version of your startup and launch it with a buy button, users will build the rest of the product\n\n3. Document everything on Twitter, because if your startup flops, you’ll still grow an audience. That will help you for future projects.\n\n&#x200B;\n\n**Link to original story:**  [How My Tiny Startup Is Making $55k/Month Four Months After Its Launch](https://dollarsanity.com/how-my-tiny-startup-is-making-55k-month-four-months-after-its-launch/)"
    },
    {
        "post_title": "Searching for an Investor/Businesspartner(s) Auf der suche nach einem Investor/Geschäftspartner(s)",
        "idea": "Ethical Adult Entertainment Complex with Integrated Escort Services in Switzerland",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18e52nb/searching_for_an_investorbusinesspartners_auf_der/",
        "post_content": "Hello I am searching for an investor to open a brothel in Switzerland. (It is a legal and safe business in the Switzerland.) Escort Business also possible.\n\nDE: Hallo ich suche nach einem Investor für einen Bordell in der Schweiz.(Es ist legal und ein sicheres Geschäft in der Schweiz) Escort Geschäft auch möglich. \n\nI have a lot of knowledge in the legal Brothel/Escort/Prostitute business. Im Looking for an Investor/Businesspartner(s) so we can open our Brothel in Switzerland with my ideas and knowledge in this industry, that we can create a great business togheter. I dont want to spoiler to much of my ideas wright know, so if you are interested to become a brothel owner with me please feel free to contact me via reddit, discord,instagram, twitter/X or email my contact infos are in my reddit bio. contact per email: [ghoost669@outlook.com](mailto:ghoost669@outlook.com) via twitter/X or discord:  ghoost669 , instagram: ghoosttzz\n\nPlease only serious inquiries!\n\nDE: Also ich habe viel Wissen im legalen Bordell/Escort/Prostitution Business. Ich suche nach einem Investor/Geschäftspartner(s) sodass wir zusammen ein Bordell eröffnen können mit meinen Ideen und Wissen in dieser Branche damit wir ein gutes Geschäft zusammen aufbauen können. Ich will nicht zu viel von meinen Ideen und Wissen spoilern. Also wer Interesse hat mit mir Bordellbetreiber/besitzer zu werden soll sich bitte bei mir melden. Man kann mich per reddit, discord, instagram, twitter/X oder per Email kontaktieren. Informationen finden Sie auf meiner Bio. Email wäre [ghoost669@outlook.com](mailto:ghoost669@outlook.com) per via twitter/X or discord:  ghoost669 , instagram: ghoosttzz\n\nBitte nur seriöse Anfragen!"
    },
    {
        "post_title": "Business idea that needs the help of someone creative executing",
        "idea": "Digital Idea Incubation Platform - A virtual collaborative space for matching creative individuals with business idea generators to execute low-risk profitable business ventures with immediate earning potential.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18dyjal/business_idea_that_needs_the_help_of_someone/",
        "post_content": "Hey i have a business idea that will make us money right away, no upfront investment, and no risk at all. And will make money immediately. I just need a very creative business partner to help me execute it because it can branch in many directions. Let me know if your interested"
    },
    {
        "post_title": "A Community for raising Venture Capital / Angel investment",
        "idea": "A digital platform facilitating streamlined matchmaking between startups and vetted venture capitalists/angel investors with integrated pitch deck enhancement tools and educational resources for fundraising.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18dob9u/a_community_for_raising_venture_capital_angel/",
        "post_content": "Hey people - I just finished raising a pre-seed round of just under £1m for my startup and it was hard as hell.\n\nI got together with a couple friends who have raised before / are currently raising, along with some that worked in the Private Equity industry for a while to create a community centred around raising capital, giving pitch deck feedback and getting VC & angel investor contacts.\n\nLong term plan is to partner with VC's to give them deal flow and give our community access and the right connections + democratise VC access by taking away that \"warm intro required\" criteria \n\nIt's hosted in discord, totally free and super useful + we grew to over 300+ people quick haha\n\n[https://discord.com/invite/KgqazycHJW](https://discord.com/invite/KgqazycHJW)"
    },
    {
        "post_title": "Landscaping Management SaaS",
        "idea": "LandscapeProjectApprove - An intuitive project management SaaS platform for landscaping companies that enables them to provide real-time digital estimates and requires client pre-approval for service tasks ensuring transparent billing and customer consent prior to service execution.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18dqv58/landscaping_management_saas/",
        "post_content": "Hey folks!  I wanted to get some feedback on an idea that I think (hope?) solves a problem I’ve encountered a couple times now. What I’ve experienced is that mid-sized landscaping companies still invoice via mail and always after services have been provided. More times than I can count I’ve been caught off guard with huge bills for services provided, despite having a contract in place. For be fair, the contract does have TBD placeholders for things like this (seeding, fertilizing, etc). I’m considering building a SaaS product that would allow customers to see and approve services before they are performed. As I type that I think I’ve used something similar for car service. Does anything like this exist? If not, any idea why not? If so thoughts on why companies don’t use it? It seems like a small monthly fee (eg. $2/customer) could be passed along to the customer so there wouldn’t be any cost to the company.  Thank you!"
    },
    {
        "post_title": "starting a business",
        "idea": "Artisanal Organic Supplement Brand with Customizable Packaging Design Service",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18dl1fk/starting_a_business/",
        "post_content": "i feel like i’m gonna be thrown in with the thousands of wannabe entrepreneurs after posting this but here goes.I’m currently 16 and have just been fired from my first two jobs and i’m starting to think that maybe being an employee isnt for me and i might be better suited to be my own boss.i’ve been sitting on an idea for a while to start my own business to sell organic supplements.i’m not sure what i was hoping to gain from this post but definitely not to be talked out of this idea-i think maybe i just wanted some input from older people about what my next steps should be in order to make this a reality and a success and maybe do some networking if anyone is interested helping me out further than just giving advice-\nit might be useful to note that i am a creative person with artistic skills if that’s relevant"
    },
    {
        "post_title": "Business to start in Hawaii with a truck in hand?",
        "idea": "Mobile Eco-Tourism Adventure Packs Rental Service",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18djiw7/business_to_start_in_hawaii_with_a_truck_in_hand/",
        "post_content": "Hello! About a year ago me and my boyfriend started a business selling food at the local farmers market. We needed a truck to haul all of our equipment and leased a 2023 Nissan Frontier for 2 years. We decided to part ways with doing the market and would like to start a new business with the remaining year on the truck lease. What do you think is the best business to start in Hawaii (Oahu to be specific). Thank you in advance :)"
    },
    {
        "post_title": "I realize I have an ability when it comes to helping other guys in my field. How can I market this while also doing them a favor?",
        "idea": "Landscaping Industry Mentorship and Business Consulting Platform",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18d3loq/i_realize_i_have_an_ability_when_it_comes_to/",
        "post_content": "I’ve been in the landscaping world for about 10 years. I’ve started a small business, not exactly where I want to be, but mainly due to my own anxiety/other business/intensive hobbies. \n\nI’ve been helping a number of guys recently. Offering design advice. Offering pricing advice. Offering help with machinery, terminology, permitting, sales, etc. while I enjoy helping these guys, I think it’s likely a marketable skill and it does take a lot of time to do it.  \n\nHow can I make this more worth my while? I get that it’s practically consultant work. But how can I market this well?  I don’t want to be one of those tacky guys who “sells a plan”. There is no set plan. But I think I can teach and add value for guys on a recurring basis. \n\nMy background in a little more detail: celebrity landscapes, sign NDAs before going on site and can’t have phones out on the job. 1mil+ dollars in trees up a driveway to keep from seeing his neighbor was oddly enough a job more than once. I’ve worked for a few very prestigious companies but am on my own and doing pretty well with my background but feel as if I could do more."
    },
    {
        "post_title": "Unique dating app features?",
        "idea": "Startup Idea: A dating app that integrates artificial emotional intelligence to offer personalized conversation starters and relationship advice tailored to individuals' dating styles and preferences encouraging meaningful connections.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18d9rl6/unique_dating_app_features/",
        "post_content": "Hey guys, I am in the early/middle stages of the birth of an app I am creating. It will be along the lines of dating/socializing. If you could throw some ideas of what is missing in dating apps that should have been added long ago? \nThank you for reading and look forward to some ideas!"
    },
    {
        "post_title": "Business in Saudia Arabia",
        "idea": "Saudi-German Innovation Hub for Renewable Energy Solutions",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18d3s94/business_in_saudia_arabia/",
        "post_content": "Hello @All,\nI'm currently working as a Senior Manager in Germany, but have had enough of corporate life and want to start a business. Looking at Saudi Arabia as I see a lot of potential. Anyone with same aspiration/motivation? Let's get in touch, have a chat and/or brainstorm ideas. Looking forward. Best."
    },
    {
        "post_title": "Finding the right manufacturer",
        "idea": "An online platform that connects hardware developers with vetted manufacturers specializing in electronic devices such as earbuds offering a step-by-step guidance process from prototype to mass production including supplier matching 3D design tweaking and quality control services.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18d0ama/finding_the_right_manufacturer/",
        "post_content": "Hi guys,\n\nLooking for a manufacturer for my earbuds with my own design and functions.\n\nI am currently engaged in a project focused on developing compact earbuds with my own design. I have already completed the 3D designs for the external case of the earbuds and have identified the necessary components. I have an existing product that can be used to “copy”.\n\nHowever, I am currently seeking asistence in sourcing the appropiate components and outsourcing the assembly of these earbuds. \n\nDoes anyone has an idea on how to find the right manufacturer? (Contacted many in China already, no succes yet)\n\nThanks from a startupper!"
    },
    {
        "post_title": "Home Cooked Meals from Local Cooks",
        "idea": "LocalEats - Authentic Home-Cooked Meal Marketplace App.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18d5bba/home_cooked_meals_from_local_cooks/",
        "post_content": "Hi everyone! 👋\n\nI'm currently working on a new app concept and would love to get your thoughts and feedback. The idea is simple yet exciting: **connecting food enthusiasts with local cooks for authentic, home-cooked meals.**\n\nImagine craving a specific dish, say, a traditional Moroccan tagine or authentic Italian lasagna, and instead of going to a restaurant or trying to cook it yourself, you use an app to find a local cook who specializes in that cuisine. These aren't professional chefs, but rather passionate cooks who love sharing their culinary heritage.\n\n**Here's how it would work:**\n\n* Users can browse the app for specific dishes or types of cuisine.\n* You can view profiles of local cooks, see their specialties, and read reviews from other users.\n* Once you find a dish you like, place an order, and the cook prepares it for you to pick up or get delivered.\n* The app focuses on authenticity, so you're getting a meal that's cooked in the traditional way, with a personal touch.\n\n**Why this idea?**\n\n* For food lovers: It's a chance to explore authentic, diverse culinary experiences.\n* For cooks: It's an opportunity to earn from their passion and share their culture.\n\n**I’m reaching out to this community because I value your opinion:**\n\n* Would you use an app like this?\n* What features would you like to see?\n* Any concerns or suggestions you might have?\n\nYour feedback is incredibly valuable and will help shape this concept into a service that people would genuinely love to use. So, what do you think? Are you ready to dive into a world of authentic, home-cooked meals with just a few taps on your phone?\n\nThanks for reading, and I'm excited to read your responses! 🍽️\n\n**P.S.** If you're a cook who might be interested in joining as a provider, I'd love to hear from you too!"
    },
    {
        "post_title": "Ai browser app",
        "idea": "AI-driven Smart Tab Organizer and Productivity Browser Extension",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18d2xos/ai_browser_app/",
        "post_content": "It's a web browser that isn't trying to fit the chat bot bandwagon in browsers its purpose was to fix the old unsolved tab problems or peoples problem with their tab hoarding and not organizing it all leading to people revisiting their tabs over and over since people don't want to look back to their bookmarks if it's too messy. Or at least that's been the case so I made my own app but it wouldn't be an immediate replacement for chtome which is the browser. I don't know if you're having the same tab problem as me or iif there's large enough demand for a solution to their tab issues but still\n\nI have created half created half of the parts of the app already so it's half working lol."
    },
    {
        "post_title": "Beautiful pill case",
        "idea": "High-end Custom Pill Organizers - A luxury wellness accessory company specializing in designing and producing elegant, high-quality pill cases made from premium materials such as wood, metal, or stainless steel, featuring seamless hinges for open and close satisfaction and customizable compartments for a week's medication. Optional engravings for personalization, catering to the discerning consumer looking for both functionality and aesthetic appeal.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18cvtr9/beautiful_pill_case/",
        "post_content": "I need someone to make this. I’d buy it. Everyone would buy it. \n\nI’m looking for a beautiful, high quality, 7-day pill case. Make of metal or wood, with doors that open all the way for easy refilling, but close with a satisfying click. \n\nSeriously, why hasn’t anyone made something like this?\n\nEveryone is searching for something to get their glamorous grandmother. I assure you, she hates her ugly, plastic, $3.99-at-CVS pill organizer."
    },
    {
        "post_title": "Olympics Local Ideas",
        "idea": "Event Sustainability Consultancy and Green Vendor Sourcing Agency",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18czt3o/olympics_local_ideas/",
        "post_content": "Utah has been confirmed to host the olympics in ~10 years. \n\nWhat businesses have been successful at getting government contracts historically?\n\nAny thoughts on how to set up a short term highly profitable business based on a global tourist event?"
    },
    {
        "post_title": "vending business idea",
        "idea": "Age-Verified Vape Vending Machines for Nightclubs",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18csb12/vending_business_idea/",
        "post_content": "i’ve been thinking on buying a vending machine but not filling it with the regular things we see all the time on em, my idea is to put vapes on it and do a deal with the owner or manager of a night club (21+ ), i know it may sound weird but at the end is just an idea. other thing is that i don’t know what kind of permissions is needed for that"
    },
    {
        "post_title": "Is this a viable business idea? Will it even work or not? Elaborate why.",
        "idea": "Legal Research Chemicals Advisory and Distribution Platform",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18cwgq5/is_this_a_viable_business_idea_will_it_even_work/",
        "post_content": "Basically my idea is to buy chemical compounds online (like from china) and resell them for like 5x-10x their price.\n\nWhy?\n\nThe research chemical sector is booming, an easier way to profit would be to buy a brand new chemical compound that's only very slightly different than the original compound. Because it's in a legally grey zone, you could ship it without being worried about getting arrested/in trouble with the law. \n\nLaws may vary, but you'd have to stay up to date on the laws of the countries you send it to, but a lot of \"research chemicals\" are almost identical to very safe compounds that people use every day."
    },
    {
        "post_title": "Need feedback on house-building-tool",
        "idea": "HouseProjectManager: An all-in-one digital platform for home construction management targeting the European market provides an integrated solution for homeowners to collaborate with architects contractors to oversee all phases of the building process including design planning budget tracking schedule management and issue reporting with a user-friendly interface designed to simplify and streamline the administrative aspects of residential construction.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18cuc1c/need_feedback_on_housebuildingtool/",
        "post_content": "Hi,  \nIn the near future, I’ll start building a house with my girlfriend. While I was searching for inspiration, I asked myself if there exists a tool or application which can help with the administrative tasks associated with building a house. After looking around for a bit, I couldn’t immediately find something like that. I am thinking of building an application like that, but since I have no experience with this I am looking for valuable feedback and recommendations.\n\nThe tool will be designed to streamline collaboration with the architect and simplify the administrative tasks associated with building a house. With this tool, you can collect technical drawings all in one place, create and update the construction schedule in collaboration with the architect and contractors, manage your budget by categorizing invoices and maintaining a clear overview of expenses, as well as report and track any issues encountered during the construction.\n\nI would love to hear your thoughts! What do you think? Would you use or have you used a similar tool, and do you have any suggestions to make it even better? Your feedback is invaluable to me and will help me further research this project.\n\n(sidenote: in first instance, this project is intended for Europe)"
    },
    {
        "post_title": "Rain creator",
        "idea": "RainSphere: Environmental Control Technology for Localized Weather Management and Agricultural Enhancement",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18csrq8/rain_creator/",
        "post_content": "I’m thinking of building a machine that shoots beams to the sky that forms nimbus clouds then it rains.\nI can build the entire machine and make it safe for the environment. \nI just need funding."
    },
    {
        "post_title": "Looking for feedback on my SaaS start-up website",
        "idea": "Startup Idea: CoFounderMatch - A platform dedicated to connecting startup founders with potential co-founders and CTOs specialized in various industries including SaaS based on skills expertise and business vision alignment.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18cp0x8/looking_for_feedback_on_my_saas_startup_website/",
        "post_content": " I built [this](https://uloantech.org/) website to paint a picture of the service I will be offering. If you could give it a look and see if it paints a complete enough picture of the software. Also feedback on the actual idea would be awesome.\n\nuLoan is going to be built around giving its customers the tools they need to manage and track a seller financed deal so both the lender and the buyer can have seemly transactions/transparency.\n\n(Also looking for a cofounder/CTO)"
    },
    {
        "post_title": "Skid steer work",
        "idea": "Digital Platform for Heavy Equipment Job Matching and Advertising",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18cqjpp/skid_steer_work/",
        "post_content": "Need help with ways to advertise our skid steer to get jobs. We have a bucket, bushhog, and mulching head but don’t do any advertising and don’t get jobs."
    },
    {
        "post_title": "wtf is the vintage online postcard industry doing better than I thought?",
        "idea": "VirtualPostcardHub - An online marketplace specializing in the curation and sale of vintage e-postcards paired with AR technology to bring nostalgia into the digital age.",
        "post_url": "https://i.redd.it/zbrq5xrnnp4c1.jpeg",
        "post_content": ""
    },
    {
        "post_title": "Overwhelmed by ideas.",
        "idea": "Idea Validation and Coaching Platform for Aspiring Entrepreneurs",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c4d7k/overwhelmed_by_ideas/",
        "post_content": "Title. I feel as if I have some good ideas, that I do believe in. But I always manage to talk myself out of them. Whether it is me saying that it won't work because of too much competition, or I do not have the skills to do it. How did you overcome these roadblocks? \n\n\nLike for example, I have an idea for a niche app. I really think it could work. But I have no experience at all creating apps, and learning how to create a well made functioning app from scratch seems impossible. I'd love to hear some stories or feedback about this. I really am passionate about creating something of my own to help support myself, but I can't seem to get over the mountain of just thinking about it.\n\n\nWanted to add that the app isn't the only idea, rather just an example. Every idea I have I seem to shut down for one reason or another. I get the feeling that it's not possible for me. For reference I am 21. I have some experience with photo editing/graphic design. Limited experience with video editing. Overall pretty comfortable with computers and different software in general. "
    },
    {
        "post_title": "Plant daycare",
        "idea": "Urban Plant Boarding and Care Service",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c31t5/plant_daycare/",
        "post_content": "Me and my wife are plant parents! We do yearly trips abroad. We always ask our family friend to come over at least once a week to water the plants and we are so grateful for it.\n\nI’ve researched online that there are hacks or tools to water the plants automatically, but personally i think it’s better if someone will look for them?\n\nHence i came up with the idea of this plant daycare, where people can drop their plants and we will take care of them."
    },
    {
        "post_title": "Email Newsletter Businesses",
        "idea": "Platform for Newsletter Creators Offering Community Support Content Strategy Tools and Monetization Assistance",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c7kv8/email_newsletter_businesses/",
        "post_content": "Hi all,\n\nI have been running an email newsletter projects for a while now. I enjoy fleshing out ideas, targeting a specific audience, building them up, monetising them, and so on.\n\nThe issue is, it's a niche area. It's hard to find answers or even other people publishing regular newsletters on Reddit, or pretty much anywhere.\n\nSo, I've decided to set up my own [r/EmailNewsletters](https://www.reddit.com/r/EmailNewsletters/) subreddit for all things email newsletters.\n\nIt's only just started. If you're a newsletter creator, interested in email newsletter businesses or anything email newsletter related - please feel free to join."
    },
    {
        "post_title": "Looking for a potential business partner",
        "idea": "Gaming Ambient Lighting Ecosystem Platform",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ca8rs/looking_for_a_potential_business_partner/",
        "post_content": "Hello Everyone,\n\nI'm looking for a potential business partner to help grow and expand my ambient lighting business, We specifically are looking to penetrate into the gaming and E sports industry providing the only realistic lighting solutions for gamers, streamers, and any other content creator or ambient lighting enthusiast, Helping the build and create the best lighting setup. Providing and hosting events weekly/monthly events for players and sponsored teams to compete for cash prizes and rewards, a custom affiliate program for teams and content creators to make commission and promote custom discount codes for their viewers. We have millions of other ideas were also looking to implement, fail, re-evaluate, and test again until we can provide the best service and eco system for our customers.\n\nIf you believe you have the same drive as I do and want to hit a home run, feel free to shoot me a message and we can discuss more details!\n\nThank you for your valuable time! "
    },
    {
        "post_title": "Have any ideas?",
        "idea": "Develop an AI-driven meme creation and sharing platform where users can create personalize and share memes with an online community integrate AR features for interactive meme experiences and introduce meme-based games and challenges to engage users.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c9dp0/have_any_ideas/",
        "post_content": "I have a domain name (lmaomemes.com) wondering what I should build using this domain or if I should get rid of it looking for mostly ideas of what to build with it since it's a decent domain any ideas? Or maybe someone to help build the site with me can talk money later"
    },
    {
        "post_title": "How can I earn from my Instagram theme page? (Women page)",
        "idea": "Socialfluencer: An influencer monetization platform offering a suite of tools for content creators to manage grow and monetize their social media presence with focus on analytical insights branded content partnerships e-commerce integration and direct fan support systems tailored for thematic Instagram pages.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c9d13/how_can_i_earn_from_my_instagram_theme_page_women/",
        "post_content": "I have started a women-based Instagram theme page less than a month ago. With less than 10 posts now, one reel went viral and I got 5k followers from the video(60% women). Now, how can I leverage this to make some money of that?  \nThe page is about women memes and relationship stuff. Any suggestion on how to start earning?\n\nAt first, I thought of posting podcasts kinda stuff, but since this one meme video got viral, I'm not sure how to take the page further. I just don't know the right monetization tools I need to use.\n\nI'm open to all suggestions, from how to run the page to the earning possibilities. Thanks!"
    },
    {
        "post_title": "Any friendly advice?",
        "idea": "Online Startup Incubation Platform providing step-by-step guidance virtual mentorship and resources for first-time entrepreneurs",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c852g/any_friendly_advice/",
        "post_content": "I have a business idea. I have done a small research and it seems like it fairly new and would be a first. Problem is, I don’t know what to do going forward or where to start? \n\nDoes anyone have advice on how they went about their business idea and can share some helpful advice ?"
    },
    {
        "post_title": "Business Idea",
        "idea": "EcoSmoke: Sustainable Herbal Inhalation Platform with Biodegradable Cartridge Subscriptions",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c834r/business_idea/",
        "post_content": "So the short of it is that I want to make a marketable new smokable product. \n\nThe basis of the product is for it to be entirely locally sourced products and eco friendly. I want to create a smokable herb device with a compostable cartridge subscription service with it. I would primarily want to focus on renewable foraged herbs like lavender and mugwort, but do see a benefit in. Including weed as an option in legal states if it did well\n\nThere is another part of the whole idea that I want to keep close until I find a partner for it. \n\nNot looking for a partner on here more sharing the idea and looking for advice on where to start? I have no business background but see a possibility for a great product that could help the environment \n\nThanks in advance!"
    },
    {
        "post_title": "Catchy name for cleaning company (residential and commercial)",
        "idea": "HygienicHub: An online platform that connects individuals and businesses with top-rated local cleaning services and provides an intuitive booking system for residential and commercial spaces.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c3cho/catchy_name_for_cleaning_company_residential_and/",
        "post_content": "What do you think would be a good catchy name that would gravitate people towards my cleaning company"
    },
    {
        "post_title": "Looking for business partner with good IOS knowledge & marketing strategy",
        "idea": "Mobile App Growth Accelerator specializing in leveraging award-winning app concepts with strategic marketing and partnership development to scale user base and revenue.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bzprd/looking_for_business_partner_with_good_ios/",
        "post_content": "I have really good business idea, I’ve actually won third place in Falling Walls speech tournament with this idea. The idea is already published, on app store and working perfectly but it needs A LOT of marketing.\n\nI’m willing to share this idea and profit it makes with someone with good background in marketing and ios development (optional)\n\nIf you’re interested, shoot me a PM i’ll show you my app which is already on app store.\n\n1.\t⁠How long has the business been operating?\n\nProbably 3-4 months without proper marketing.\n\n2.\t⁠Where is this entity/business registered?\n\nIt’s worldwide, published on app store.\n\n3.\t⁠Is geography a factor in the partner you seek?  Why/why not?\n\nNope.\n\n\n4.\t⁠Is this an online-only (no physical presence) business?\n\nYes.\n\n5.\t⁠What is the proposed arrangement for the partner? Are you offering them shares, will they be a director, paid as a contractor? What did you have in mind?\n\nThey’ll have fair amount of shares.\n\n\n6.\t⁠What about capital? Is this partner expected/required to invest?\n\nNot really, unless it’s absolutely necessary \n\n\n7.\t⁠Which currency?\n\nUSD\n\n8.\t⁠What are you looking for from a partner (skills) AND what is it that you bring to the table?\n\nI’m looking for someone to promote the app, bring in users while I develop the app further and further.\n\n\n9.\t⁠Will the partner be able to provide input/suggest changes to the entity's constitution?\n\nOf course.\n"
    },
    {
        "post_title": "Participants for business soundings",
        "idea": "Virtual Financial Advisory Platform that connects aspiring financial advisors with individuals seeking finance-related advice for mock advisory sessions",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18c2i6h/participants_for_business_soundings/",
        "post_content": "Hi there, I need willing volunteers to answer my questions for an exercise I have to complete for starting M&G Academy. Hopefully a few people will be able to answer these for me?\n\n* I am planning to build a new career as a Financial Adviser. What are your thoughts on this career for me? \n* Do you currently take any financial advice? If so, where. If not, why not? \n* When I am qualified Financial Adviser, would you be happy to sit down with me to review your finances? "
    },
    {
        "post_title": "QR code that leaves automatic 5 star review when customer scans it from their phone.",
        "idea": "Startup Idea: Ethical Review Booster Platform\n\nA platform offering businesses a legitimate way to encourage customers to leave authentic reviews through innovative yet ethical incentives. Using QR codes, businesses can simplify the review process, but instead of an automatic 5-star rating, the system prompts customers to write a genuine review. The startup would leverage analytics to help businesses understand customer satisfaction and improve services while ensuring full compliance with review platform guidelines.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bp9wr/qr_code_that_leaves_automatic_5_star_review_when/",
        "post_content": "As the title says, I am interested to see other opinios about this idea, because it sounds good to me but maybe I dont know a lot about that stuff. So basically, I would hire a programmer to make me a programme that automatically leaves 5 star review under Google account of a coffe shop (for example) from Google acounts of customers who scan the QR code with their phones. I would also make the QR codes which would be visible on the stickers that would be on the tables in coffe shops.\n\nI would need to change code lines for every coffe chop, but it wouldnt be much work because algorithm is the same, just the link to certain coffe shop would need to be changed. I would contact owners of the coffe shops and offer them this service.\n\nSo guys, please be kind and tell me do you think if this could work, and what would be cons and pros. Cheers."
    },
    {
        "post_title": "Small building business ideas",
        "idea": "QuickServe Local Eats Hub: A multifunctional fast-casual dining and local food products retail hybrid that focuses on providing quick, quality meals, leveraging the foot traffic from the surrounding apartments and trailer park, while also serving as a storefront for local artisans and food producers to sell their goods, creating a community-centric food hub.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bowne/small_building_business_ideas/",
        "post_content": "Hey guys going to keep this short. I need some profitable small business ideas. I inherited a small building think of a small convenience store. It’s on a BUSY road in the heart of a 30k populated city with a small parking lot maybe 10 car parking. The city has a good police force and below average crime rate. The building is within walking distance from many apartments neighborhoods, and trailer park. What are some good business ideas 2 young guys with no kids an\nd limited recourses could start. Also before a gas station is proposed the parking area is too small and resources are limited.  Also a liquor store is prohibited here. This is in Mississippi btw. I was thinking it would make a prime vape or phone repair spot. (EDIT: I’d rather not do this but I could invest maybe 200-400k in the right idea) THANKS"
    },
    {
        "post_title": "Benefits navigator of sorts",
        "idea": "Healthcare Engagement Platform providing tailored benefits navigation and appointment scheduling services for employees to optimize utilization of preventative healthcare options offered by their employer-sponsored insurance plans.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bx9ai/benefits_navigator_of_sorts/",
        "post_content": "Looking to start a business where I help people get free preventative services that come with their employer sponsored health insurance. A lot of people don’t have a primary care provider and are disengaged from their healthcare. So I would basically call people up and see if they wanted to get a free annual visit. If they said yes, I’d schedule the appointment. I would pitch the conversations as general benefits navigation to be less intrusive. There could be other services offered eventually, but this would be the central aspect of it: Getting people engaged in their care.\n\nI’d sell to employers/HR groups.\n\nEmployers would get a workforce more engaged in their healthcare, which would ultimately save them money on insurance. Employees would get the convenience of a proactive benefits navigator, which would be convenient for them. And I would get paid for this activity.\n\nThose are the bones of it. What do y’all think? Is this viable or a bad idea?"
    },
    {
        "post_title": "I have a business idea but no money and Idk how I would do it",
        "idea": "Cozy Clean Lounges: A chain of eco-friendly laundromats with integrated relaxation and social lounge spaces offering quiet activities and amenities for napping and casual community building while customers wait for their laundry.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bkqo3/i_have_a_business_idea_but_no_money_and_idk_how_i/",
        "post_content": "I want to open a coin-laundromat that also acts as a lounge for napping or 3rd place for quietly socializing lol. Like I know lots of people love the sound/smell of laundry and it would be cool to have a place to do your laundry and rest. It could also be helpful to people that don't have a stable place to live, or who would just like a moment to step away from their parents/kids without having a hotel room. I'm thinking bean bags, large cushions, and stuff would be cool. Also stuff like board games, books, and other quiet activities. It could be a cool lowkey third-space for meeting people. Idk does anyone have any feedback or advice for how someone could make this happen without actually having money lol"
    },
    {
        "post_title": "This is awesome!",
        "idea": "SentimentPrompt Content Analysis Platform",
        "post_url": "https://www.reddit.com/gallery/18b54f2",
        "post_content": ""
    },
    {
        "post_title": "Your Personal/Business Cyber Security.",
        "idea": "Cyber Hygiene as a Service (CHaaS) platform offering automated password management updates data backups system and network security audits and device optimization for individuals and businesses to maintain digital health and security.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bkm1h/your_personalbusiness_cyber_security/",
        "post_content": "I would take the time ladies and gentlemen to update all passwords, and back up all data to appropriate back-up systems this week. \n\nIt's been awhile for some of you I bet when it comes to updating the network, or just as simple as changing passwords, and in a world where cyber attacks are sadly becoming extremely common.\n(ITS EXTREMELY IMPORTANT TO DO SO.)⚠️\n\nSo please get updated today, or if anything, because life gets in the way, or you have a lot of moving parts to your business, get it done by the end of this week. \n\nJust make sure to remember your passwords.\nDon't go through the process without remembering the keys to the house. \nIt can be a damn headache for some systems. \n\nAs for your network, I would check to make sure everything is updated, a system that's not updated, is like a system with a weakened immune system... (Not good...)\n\nClear your caches too, no need for old data, most systems have that same data at the source.  \n\nClean your phones and systems too, with trusted software, don't ever use anything you haven't heard from before. You would be surprised how slow a system gets and unsafe do to unused old data... \n\nThose are some ways to keep yourself protected, and your business protected. \n\nI hope you all take my advice, I hope this was helpful, and I wish you all a healthy digital experience."
    },
    {
        "post_title": "Bicycle renting shops",
        "idea": "Peer-to-Peer Bike Rental Platform for Urban Commuters with Integrated GPS Based Tracking and Community-led Maintenance Workshops",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bkqix/bicycle_renting_shops/",
        "post_content": "Can i get help on a bicycle renting shop ideas or maybe a business plan or a specific shop that is currently running."
    },
    {
        "post_title": "What tool or piece of equipment can I buy for under $1000 will make a big expensive job way faster & easier?",
        "idea": "MobileToolRentalApp: An online platform for renting out high-quality professional tools and machinery for specific jobs allowing users to access expensive equipment at a fraction of the purchasing cost making DIY projects and small business startups more viable.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18az84e/what_tool_or_piece_of_equipment_can_i_buy_for/",
        "post_content": "This way I can knock out big expensive jobs and start a business out of it. I only have $1000."
    },
    {
        "post_title": "Networking for Business Ideas!",
        "idea": "Business Partner Matchmaking Platform for Startup Collaboration and Networking",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bhc2t/networking_for_business_ideas/",
        "post_content": "Hello everyone,\n\nI've got a promising business concept outlined, but there are several key aspects, such as design, costs, and other fine details, that still need to be ironed out. However, I firmly believe that a successful business also hinges on a strong marketing and sales strategy.\n\nIn light of this, I'm currently searching for a dedicated social platform where I can connect with potential business associates who can help me further refine and execute this concept. While platforms like Facebook are widely used, they tend to attract a lot of aspiring entrepreneurs, making it challenging to identify the right partners. On the other hand, LinkedIn might be an option, but I'm unsure about its effectiveness in this context.\n\nI'd greatly appreciate insights from anyone who has experience using a particular platform to interact with prospective business partners, especially in the early stages of concept development. Your advice and suggestions would be invaluable!"
    },
    {
        "post_title": "I want to start a taxi company",
        "idea": "Digital Taxi Platform with Integrated Booking System and Branding Services for Local Taxi Companies",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18blsiz/i_want_to_start_a_taxi_company/",
        "post_content": "I want to start a taxi company as most local companies in my area lack a good website for booking and good booking services so if I could get that sorted it will be fine so I am looking for investment"
    },
    {
        "post_title": "I can build you a low-cost tech support, call center, or software outsourcing team in Europe",
        "idea": "Startup Idea: Virtual Team-As-A-Service Platform - A digital marketplace that connects businesses with outsourced tech support call center and software development teams in Eastern Europe offering multilingual support and coding services at competitive prices.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18bgitk/i_can_build_you_a_lowcost_tech_support_call/",
        "post_content": "\nHey community,\n\nI have solid connections, a team of people talking multiple languages, and a team of coders in Bosnia and Serbia.\n\nThey are low-cost and a good cultural fit as most people work for international companies.\n\nIf someone is looking to build a technical, support, or call center or outsource a software team - let's connect."
    },
    {
        "post_title": "Seeking Advice on Earning Opportunities Through Import-Export Between Algeria and England",
        "idea": "An international digital marketplace platform that connects local Algerian businesses with suppliers of electronic devices in the UK providing a streamlined process for bulk purchasing negotiation consultancy and personalized logistics solutions to ensure compliance with import-export regulations while maximizing cost-efficiency and scalability for small to medium-sized ventures.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18be21q/seeking_advice_on_earning_opportunities_through/",
        "post_content": " \n\nHey fellow Redditors,\n\nI hope this post finds you well! I've been an avid follower of this community, and I've seen some incredible insights shared here. Today, I come to you seeking advice and guidance on a potential business venture involving my brother, who recently moved to England for studies and work.\n\nHere's the scoop: My brother, an Algerian like myself, is now residing in England for his studies and employment. We've been brainstorming on ways to leverage his frequent travels between Algeria and England to explore opportunities in buying and reselling goods, particularly electronic devices like laptops and tablets.\n\n I'm aware of the legalities and restrictions surrounding importing and reselling, but I believe there might be some hidden tips or strategies to navigate this terrain effectively. If any of you have experience or insights into the import-export business, especially with a focus on electronics, I would greatly appreciate your input. \n\n Specifically, I'm interested in: \n\n&#x200B;\n\n \n\n1. **Finding the Best Prices:** Are there any platforms or strategies to source laptops and tablets at competitive prices in England? Perhaps there are lesser-known outlets or tips for negotiating better deals.\n2. **Logistics and Regulations:** Given the legal restrictions, are there specific items that are easier to transport or regulations that are less stringent? Any advice on navigating customs or adhering to regulations when bringing goods from England to Algeria?\n3. **Scaling the Operation:** How can we gradually scale this operation over time? Are there methods my brother could employ to bring more goods with him on his trips between Algeria and England without running into logistical or legal issues?\n\n&#x200B;\n\n \n\nI believe this community holds a wealth of knowledge, and I'm excited to learn from your experiences. Your insights could not only help my brother and me but also others who might be considering similar ventures.\n\nThank you in advance for your time and expertise. Let's brainstorm and explore the possibilities together!"
    },
    {
        "post_title": "Business Idea for my entrepreneurship course",
        "idea": "EcoLuxury Branding Consultancy: A specialized agency providing comprehensive branding and marketing services for luxury and semi-luxury brands with a focus on environmental sustainability and social activism.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18b7pp2/business_idea_for_my_entrepreneurship_course/",
        "post_content": " Hi\n\nFirst of all, I have for my entrepreneurship course to create a project around a business idea. I am describing mine to you in order to get feedback, recommendations and to know if it could work. My company is a communications agency that describes itself as a spoke person for committed luxury. Its goal is to offer 360° support to committed (ecological, humanitarian...) luxury and semi-luxury brands emerging on the market in order to show that luxury can also be associated with activism.\n\nThank you for any feedback."
    },
    {
        "post_title": "AIRPORT runners ??",
        "idea": "Airport Personal Shopper Delivery Service - An on-demand platform for airport patrons to order any items from stores within the airport to be delivered to their terminal gate or security line by a dedicated runner.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18b60pf/airport_runners/",
        "post_content": "How about an app for airport goers similar to doordash, uber eats etc. \n\nYou go on the app and order whatever you’d like from any store in the airport and a “runner” will get the items or food etc and run it to you allowing you stay at your terminal or gate.\n\n or perhaps your short on time and won’t be able to grab what you need when you get the rough security this will allow you to do so while waiting at security… That way when you get to your gate or terminal the runner will meet you there with the items or food that you ordered…\n\nDoes doordash or uber do this??? Idk let me know yalls feedback?"
    },
    {
        "post_title": "Hiding a treasure for someone as a birthday gifts?",
        "idea": "Adventure Gift Experience Platform: A personalized treasure hunt service for special occasions where customers can hire experts to create custom themed and cryptic scavenger hunts tailored to the interests and hobbies of the gift recipient enhancing birthdays and celebrations with an adventure twist.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18ahac6/hiding_a_treasure_for_someone_as_a_birthday_gifts/",
        "post_content": "Hi, I am thinking about offering a service where I hide a treasure for others that are looking to make an exciting birthday present.\n\nI have years of experience in geocaching, tourism/hiking and cryptology so I think I could be really good at this. Do you guys think a service like this has any potential?"
    },
    {
        "post_title": "What strategies would you recommend to tap into this market?",
        "idea": "Create a mobile app and platform dedicated to woodworkers and hobbyists that connects them with suppliers like Turbosawmill showcasing product tutorials live workshops and a marketplace to facilitate equipment sales and dealer networking.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18aszpl/what_strategies_would_you_recommend_to_tap_into/",
        "post_content": "I'm curious to hear your thoughts on how Turbosawmill ( [https://turbosawmill.com/](https://turbosawmill.com/)) can further expand its presence in the USA market? I'm helping a fellow friend who is involved in the company with some ideas, and I know this is the right place to ask. \n\nWhat strategies would you recommend to tap into this market?\n\nI'm particularly interested in ideas that focus on:\n\n* Increasing brand awareness among American woodworkers and hobbyists\n* Expanding dealer networks to reach more customers across the country\n* Tailoring marketing campaigns\n\nThank you for sharing your insights!"
    },
    {
        "post_title": "5 digital business started with less than $100 & making more than $1,000 per month",
        "idea": "A platform for sharing comprehensive success templates and detailed roadmaps used by profitable solo entrepreneurs across various digital niches including actionable insights and tools recommendations to replicate their success.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/189u9l9/5_digital_business_started_with_less_than_100/",
        "post_content": "&#x200B;\n\n[DeploymentFromScratch.com](https://deploymentfromscratch.com/?utm_source=www.indiehustle.co&utm_medium=referral&utm_campaign=making-40-000-from-selling-two-digital-products)\n\n🧐 Niche: [Digital Products](https://www.indiehustle.co/?tags=Digital+Products)\n\n✏️ Description: An Ebook on web application deployment\n\n💰 Revenue: $40,000 from Gumroad\n\n💵 Monetization: Product sales\n\n&#x200B;\n\n🚀 From this [interview](https://www.indiehustle.co/p/making-40000-selling-two-digital-products):\n\n>\"The original price from the beggining is $50 and never changed. I should probably experiment more with pricing going further.\"\n\n&#x200B;\n\n\\---\n\n&#x200B;\n\n[NoCodeExits.com](https://www.nocode-exits.com/?utm_source=www.indiehustle.co&utm_medium=referral&utm_campaign=her-site-about-no-code-founders-makes-12-000-in-just-10-months)\n\n🧐 Niche: [Newsletter](https://www.indiehustle.co/?tags=Newsletters)s\n\n✏️ Description: A newsletter about stories of profitable or acquired products made without writing code\n\n💰 Revenue: $12,000 in 10 months\n\n💵 Monetization: Sponsorships, info products\n\n&#x200B;\n\nFrom this [interview](https://www.indiehustle.co/p/her-site-about-no-code-founders-makes-12-000-in-just-10-months):\n\n>\"For my newsletter I have 0 costs.\n\n* Substack = free\n* Softr landing page = free version\n* Tally forms for interviews, feedback etc = free\n* Airtable for my operating system = free\n* Pika.style for screenshots = free\"\n\n\\---\n\n&#x200B;\n\n[Actorle.com](https://www.indiehustle.co/p/an-actor-guessing-game-making-4-000-every-month)\n\n🧐 Niche: Game\n\n✏️ Description: a fun daily movie-themed guessing game\n\n💰 Revenue: $4,000 Every Month\n\n💵 Monetization: Ads, Paid subscription\n\n&#x200B;\n\nFrom this [interview](https://www.indiehustle.co/p/an-actor-guessing-game-making-4-000-every-month):\n\n>\"As far as expenses go, they're minimal — around $50 per month, mostly for hosting the games on my website.\"\n\n\\---\n\n&#x200B;\n\n[Pexmotion.io](https://pexmotion.io/?que=F2557D&utm_source=www.indiehustle.co&utm_medium=referral&utm_campaign=a-one-person-productized-video-editing-agency-making-4-000-mrr)\n\n🧐 Niche: [Service Business](https://www.indiehustle.co/?tags=Service+Business)\n\n✏️ Description: a one-person video-editing productised service\n\n💰 Revenue: $4,000 Every Month\n\n💵 Monetization: Paid subscription\n\n&#x200B;\n\nFrom this [interview](https://www.indiehustle.co/p/making-4000-monthly-oneman-productized-videoediting-agency):\n\n>\"I am currently making $4000 MRR and my monthly spending would be $15 for Framer web hosting, $35 for the LLC company run and $50 for Adobe creative cloud subscription..\"\n\n\\---\n\n&#x200B;\n\n[Seomatic.ai](https://seomatic.ai/?utm_source=www.indiehustle.co&utm_medium=referral&utm_campaign=a-no-code-seo-tool-making-2-000-monthly)\n\n🧐 Niche: [SaaS](https://www.indiehustle.co/?tags=SaaS)\n\n✏️ Description: a no-code SEO tool to develop SEO pages autonomously\n\n💰 Revenue: $2,000 Every Month\n\n💵 Monetization: Paid subscription\n\n&#x200B;\n\nFrom this [interview](https://www.indiehustle.co/p/a-no-code-seo-tool-making-2-000-monthly):\n\n>\"Currently making $2K MRR and it costs me $32 per month to run with *Bubble.io*, MailerLite for email solution, SurferSEO for on-page SEO optimization, June for Product Development, Senja for testimonials.\"\n\n\\---\n\n&#x200B;\n\n&#x200B;\n\nI run this [directory of one-person business](https://www.indiehustle.co/) where I interview and feature indie founders on how they started and grew their business."
    },
    {
        "post_title": "Guyss I NEED A BUSINESS",
        "idea": "SmartSweets Tutoring & Confectionery Hub - An educational platform that provides personalized tutoring services to students while integrating a confectionery delivery service for study snacks.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18al94l/guyss_i_need_a_business/",
        "post_content": "For context im in highschool and i need some money im people think im fairly smart and sometimes people go to me for tutoring but for free and i have access to things like sweets n Candies Im thinking of trying a sweets business or smth But i really dont know how to make money here"
    },
    {
        "post_title": "Racing sim.....",
        "idea": "Virtual Racing Experience Centers: A chain of high-end virtual racing simulators featuring immersive environments with options for motion effects realistic controls and VR located in strategic high-traffic shopping malls with a business model that includes pay-per-minute races profit sharing with mall shops and the potential for private event hosting like birthday parties or team-building exercises.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18adc0b/racing_sim/",
        "post_content": "Hey there everyone. I recently had some random ad appear about some nice looking racing sums. I did some research and looks like there are a few options with very option studded racing Sims with sound system and motion effects , curved monitors  vs VR,realistic pedals and steering wheels and racing seats included for a-low 20k$'s vs mid 30k$'s based on some differences. I spoke with the company and they're willing to provide units for commercial use on 0%April via affirm, for around 500$/ month. I was thinking whether it would be a fruitful idea to speak with a busy shop at the shopping mall to provide some space for the machine and maybe share the profit... if u even start with sub 1$/min, what are your thoughts on the business idea?"
    },
    {
        "post_title": "No more Parking Anxiety",
        "idea": "Sure, here is a startup idea based on the Reddit post:\n\nParkAssist Pro – A mobile application offering on-demand parking reservation services where users can hire a \"Parking Concierge\" to find and hold a parking spot at any busy location until the user arrives ensuring a stress-free and guaranteed parking experience upon arrival at destinations such as sports events concerts beaches and shopping malls.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18aahep/no_more_parking_anxiety/",
        "post_content": "Here’s the idea. Think of Uber, Uber eats, Door dash etc. here’s what i was thinking and yall can be brutally honest. \n\nAn app where people can go on and request a “Driver” Or “Parking assistant” to go to the desired location and park for the customer until the customer has arrived.\n\nLocations may be Sports events, concerts, beaches, malls, any busy areas where people may have the fear of “finding parking”. Everyone wants free parking but imagine paying some guy to go park in a space for you and you have the peace of mind that when you get to your destination you already have someone waiting in a parking space for you in exchange for a small fee.\n\nWhat are yall’s thoughts ???"
    },
    {
        "post_title": "Thoughts on A Platform For Educators And Creators to Create their Own Course Landing Page and Ease Student Enrolment Processes.",
        "idea": "AI-driven Educational Marketplace Platform Offering Customizable Landing Pages Enhanced Analytics and Student Engagement Tools for Individual Educators and Institutions to Increase Enrolment and Optimize Course Management",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18acoaf/thoughts_on_a_platform_for_educators_and_creators/",
        "post_content": "We are developing a platform designed for educators and tutors to build a white-labeled course recruitment system with the help of AI. We integrated marketing tools, booking, and payment systems into the same platform so educators can scale their education business and recruit more students. It’s like Shopify made for educators. We are still in the post-launch phase and would like to get insight on things we can improve.\n\n**What’s Sets Us Apart From The Pack?**\n\nWe want to ease the lives of educators in managing their student enrolments and payment processes with the addition of self-marketing their course landing page using a customizable bio-link and additional SEO services depending on which tier-plan users purchase. In addition, users are not limited to creating course pages but also workshop and event landing pages depending on their niche; a DIY company could promote workshops for potential clients or a yoga instructor could promote their yoga classes by creating their landing page etc. Our range of potential clients is from small individual creators to established education institutions.\n\nFeel Free To Give Us Suggestions on:\n\n1. Appeal to education content creators: What could we add to make it more appealing to thisdemographic?\n2. Appeal to education institutions(tutorial centers): How could we improve our reach to suchmarkets.\n3. Any features we could add or improve on?\n4. Any additional thoughts or feedback?: We are open to all kinds of opinions and ideas!\n\n&#x200B;\n\n We would be grateful for any insights given to help tune our platform! "
    },
    {
        "post_title": "The home business academy",
        "idea": "Startup Idea: High-Commission Affiliate Platform for Home-Based Entrepreneurs - Develop a comprehensive online platform that specializes in connecting home-based business owners with high-commission affiliate marketing opportunities, featuring a robust selection of products, detailed analytics, marketing training, and a supportive community for entrepreneurs.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18aq4rp/the_home_business_academy/",
        "post_content": "Hi folks how you all doing? I hope all is well.\n\nI wanted to reach out to some people who might be interested in a new business project that pays affiliates 80% commissions.\n\nIts quite different from other projects I’ve been apart of before. Now i know this would not be a fit for some people on this group but wanted to reach out in case it could benefit you or someone close to you?\n\nIf so i have a short video that you could view by messaging me on here or view [here](https://academy.samcart.com/referral/aio/VKaKGlzHpa1P1OAY) \n\nHave a nice evening folks \n\nBest regards"
    },
    {
        "post_title": "What is the best way to validate an idea?",
        "idea": "SAAS Idea Validation Platform that provides tools and services for entrepreneurs to test market demand hypothesis-driven experiments and feedback aggregation before full-scale development.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18a9u02/what_is_the_best_way_to_validate_an_idea/",
        "post_content": "I want to validate one SAAS model.  \nHow do you validate?  \nI would appreciate any idea."
    },
    {
        "post_title": "15k to invest, Europe, manufacturing, Ecom",
        "idea": "Customizable Tech Accessories Manufacturing Business with a focus on high-quality 3D printed and CNC machined items such as personalized phone cases earbud holders and smartwatch stands with a robust e-commerce platform for scalability and brand development",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18a27f8/15k_to_invest_europe_manufacturing_ecom/",
        "post_content": "Dear people of reddit,\n\nI’m a 23 year old guy that wants to start a business. I’m located in Europe and am able to invest 15-20k euro comfortably. I have direct acces to manufacturing equipment such a CNC machines, 3D printers and much more. \n\nI have a background in Electrical engineering and photo/video. I’m not skilled with computers. \n\nPreferably I would create and sell something, make a brand out of it and make it “easy” to up-and-down scale. \n\nI’ve been thinking about:\n- high quality safety razors\n- watch straps \n- other small goods\n\nI’m interested in anything you have to say, so please go ahead. Thank you very much."
    },
    {
        "post_title": "Thoughts on A Platform For Educators And Creators to Create their Own Course Landing Page and Ease Student Enrolment Processes.",
        "idea": "Educational Marketplace Platform with Integrated AI-driven Customization Tools for Personalized Course Marketing and Student Relationship Management",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18acoah/thoughts_on_a_platform_for_educators_and_creators/",
        "post_content": "We are developing a platform designed for educators and tutors to build a white-labeled course recruitment system with the help of AI. We integrated marketing tools, booking, and payment systems into the same platform so educators can scale their education business and recruit more students. It’s like Shopify made for educators. We are still in the post-launch phase and would like to get insight on things we can improve.\n\n**What’s Sets Us Apart From The Pack?**\n\nWe want to ease the lives of educators in managing their student enrolments and payment processes with the addition of self-marketing their course landing page using a customizable bio-link and additional SEO services depending on which tier-plan users purchase. In addition, users are not limited to creating course pages but also workshop and event landing pages depending on their niche; a DIY company could promote workshops for potential clients or a yoga instructor could promote their yoga classes by creating their landing page etc. Our range of potential clients is from small individual creators to established education institutions.\n\nFeel Free To Give Us Suggestions on:\n\n1. Appeal to education content creators: What could we add to make it more appealing to thisdemographic?\n2. Appeal to education institutions(tutorial centers): How could we improve our reach to suchmarkets.\n3. Any features we could add or improve on?\n4. Any additional thoughts or feedback?: We are open to all kinds of opinions and ideas!\n\n&#x200B;\n\n We would be grateful for any insights given to help tune our platform! "
    },
    {
        "post_title": "Suburban organic farm",
        "idea": "HydroponicHomeKits - A DIY Sustainable Home Gardening Startup that provides easy-to-assemble hydroponic garden kits for urban and suburban homes enabling users to grow fresh organic produce efficiently in limited spaces. Offering customizable options ranging from beginner to advanced systems with educational resources to foster a community of home gardeners and small-scale urban farmers.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18a6fwf/suburban_organic_farm/",
        "post_content": "I have a gardening hobby that's quickly growing. (Pun intended)\n\nOutside: I currently have two 3'x8 cinder block' raised beds,one with flowers to attract pollinators, one growing garlic. I have flowers in the permiterer as well. I have two rain barrels that provide water to each raised bed. I have 5 large pots growing cucumbers, tomatoes, and peppers. I can grow almost year around as I live in Florida.  \nI also have two blueberry bushes. They should produce fruit in about a year. \n\n \nIndoors:  have two hydroponic indoor gardens that can grow up to 36 plants at a time each. I also have 3 aerogardens that can grow herbs and smaller plants they can each grow 9-12 plants. \n\nI probably have enough room for 1-2 more raised beds outside. And maybe 1-2 more large hydroponic gardens(thinking about DIYing the next ones myself).\n\nI was thinking about selling all the produce at a local farmers market, problem is even with increased capacity I don't know that I would get enough to sell. \n\nMy next idea I was thinking about experimenting with the DIY hydroponics garden and selling them. I have a few ideas for designs, but would need to make prototypes."
    },
    {
        "post_title": "Best site or platform to create list of my products - the catch is I need it to be able to show photos or video.",
        "idea": "VisualInventoryLister: A cloud-based interactive inventory management platform offering seamless integration of high-resolution images and videos with product listings enabling sellers to share dynamic visual catalogs with customers through a user-friendly interface.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/189mez0/best_site_or_platform_to_create_list_of_my/",
        "post_content": "\n\nHi, I sell on eBay. But there are some items I’d like to sell off eBay.\n\nI’m trying to create a product list that can have all the things eBay has, such as description, photos.\n\nI have tried google sheets and that works well, but photos aren’t very convenient to have on there. \n\n\nIs there any site or listing place that I can put some inventory where photos are easily displayable such as eBay?\n\nFYI- I’m just trying to find a place that I can create an inventory list that I send to my customers that videos or photos can be on the list as well. \n\nAnyone have anything you recommend? Thank you!"
    },
    {
        "post_title": "Longevity/transhumanism business ideas with no experience?",
        "idea": "Virtual Reality Longevity Education Platform",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18a05od/longevitytranshumanism_business_ideas_with_no/",
        "post_content": "."
    },
    {
        "post_title": "Platform for contributing to open source projects and getting paid for it",
        "idea": "OpenDevPay: An online marketplace connecting programmers with open-source projects offering paid development tasks crowdsourced by project maintainers who can assign feature tickets with attached bounties. The platform ensures secure transaction handling and code integrity while providing instant payment upon pull request approval and offers subscription tiers for advanced project management tools and increased pull request limits.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1899f39/platform_for_contributing_to_open_source_projects/",
        "post_content": "The platform would be aimed mainly for programmers, that are looking for ways to make extra money and help develop new projects in their free time. \n\n1. The structure would basically be like a GitHub, but the author would also be able to create feature tickets, which would have a feature description and what criterias it should meet (basically Jira board) and attach a price tag with it. \n\n2. You would get paid instantly after the pull request has been approved\n\n3. People could also create their own pull requests and attach their own price to it (or leave it for public or author to decide). Not sure about this, since author could just copy the code and paste it in the project, but there might be some ways to prevent this.\n\n&#x200B;\n\nThe author could delegate permissions to people, who can approve, test, manage how many approvals it needs to be merged, etc.\n\n&#x200B;\n\nThere are many ways to monetize this platform, a few of those could be: \n\n1. Taking a percentage of each completed pull request\n\n2. Having different paid plans, which increase total pull request count per day \n\n3. Having paid automated tools for checking, testing, auto-merging pull requests\n\n4 After project reaches certain size throshold (example 1GB>) you get paid each month a fee\n\nThese are a few examples, but the idea would be to make the platform free to use as much as possible"
    },
    {
        "post_title": "Frontend Practice Tool",
        "idea": "Interactive Frontend Development Exercise Platform with Gamified Challenges and Progress Tracking",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1896akk/frontend_practice_tool/",
        "post_content": "Hi, I have this business idea about building a tool that helps frontend web developers practice and build user interfaces with good numbers of exercises/chapters. \n\nWhat are your thoughts?\n\nThanks."
    },
    {
        "post_title": "Food/snack concept",
        "idea": "Dehydrated Fruit Snack Company specializing in innovative packaging and serving of dried watermelon slices for convenient and mess-free snacking on the go.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/189jtrn/foodsnack_concept/",
        "post_content": "Dehydrated watermelon in a bag, easily stackable have like 5-6 per bag each bag around 3-4 £s. Apparently dried watermelon is rly good and who wants to carry around watermelon with them very messy to eat in public. By Removing the mess problem here is a winning product !"
    },
    {
        "post_title": "Allotments in the UK",
        "idea": "GreenShare: Collaborative Allotment Management and Rental Platform",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1899xp7/allotments_in_the_uk/",
        "post_content": "Scrutinise my idea 💡 \n\nBuying plots of land in the uk, splitting them purchased plots in to allotments and rent them out to interested gardeners! \n\nHaving had a look online at a few local borough in my area it seems that every council has a waiting list of people to rent an allotment from a variety of councils. \n\nExample: \n\n1 acre of land is approximately 60m x 60m and you could look at fitting 6 allotments of 20m x 10m which still leaves some areas for access to and from the allotments. \n\n1 acre of land is approximately £7,000 - £10,000 per acre. (Let’s assume £10,000) \n\nRent each allotment out for £50 which would be £600 per month or £7200 per annum which would give a gross yield of 72%. \n\nObviously there would be start up costs as well to factor in.\n\nIssues to consider:\n\n- actual prices to rent allotments\n- planning issues to gain allotment off standard agricultural land\n- set up costs (purchasing land, setting up allotments with fencing etc) \n- the can and can’t do’s for the tenants \n- how to manage to millions in profit 😉🤣\n\nWhat’s everyone’s thoughts\nwhy wouldn’t it work\nWhy could it work\nDo you think it would work? \n\nLooking forward to your responses"
    },
    {
        "post_title": "Business that involves mass amounts of information from Bankers, Insurance agents, Verizon/T-Mobile workers, and Pharmaceutical workers.",
        "idea": "Unified Data Marketplace Platform for Industry Insights",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18955u2/business_that_involves_mass_amounts_of/",
        "post_content": "I’m  thinking about starting a data business. Gathering mass amounts of information and having people place bids. Any advice from people who work in these sectors please."
    },
    {
        "post_title": "Real house replica for children",
        "idea": "Childhood Estates: Customizable Miniature Homes for Kids",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1898t79/real_house_replica_for_children/",
        "post_content": "Hi. So I got this idea of making a real house replica for children outside, looking exactly the same (99% or whatever is possible), built like a real house with isolation and keys to the front door and some kind of “document” of ownership for the child. What do you think?"
    },
    {
        "post_title": "Can this idea be possible?",
        "idea": "Virtual Land Investment Platform with Dynamic Pricing Model",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1895s1q/can_this_idea_be_possible/",
        "post_content": " \n\nI've been thinking about a virtual real estate thing for some time. A website where you buy virtual land for a fixed base price let's say 1$, the base price then goes up or doubles after a fixed interval of time let's say 1 week. The one who bought the land at first place can sell it to anyone who requests making it profitable for anyone who bought at the start.\n\nThis can continue on for some time till the price of land gets ridiculously high then the increase in price starts to decline.\n\nThere's fixed quantity of land available so once it's all bought the only way to get one is to request it at a certain price that someone might be willing to sell for.\n\nI understand that this requires a lot of advertising and management to function costing loads of money. I mean it is still half cooked but can this actually be possible or even successful? What do I need to make it real?"
    },
    {
        "post_title": "12 Random Weird Websites With Up To 2 MILLION Visitors Per Month!",
        "idea": "NicheAudibleStories: An online platform offering unique, tailored audio stories and soundscapes designed for various niche audiences, catering to specific interests or hobbies, and monetizing through subscription fees and targeted advertising.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1883tvp/12_random_weird_websites_with_up_to_2_million/",
        "post_content": "I feel like a lot of people looking for business ideas, especially online ones, over complicate it and think they have to create something new, unique, revolutionary or ground breaking when there's people making money off some of the weirdest, randomest, and niche topics under the sun.\n\nYou don't have to create the next Facebook or TikTok to make money online, seriously I've been doing this for a decade now...\n\nI'm a bit of a junkie when it comes to business ideas and discovering random websites (always looking to create something new) so I subscribe to a lot of newsletters and tools where you can find business success stories, trending products, new profitable affiliate offers and I stumble across some strange businesses and websites that blow my mind with how bizarre they are yet how much traffic they have.\n\nI hope this post is proof that almost no matter what your idea is and whether it seems too unusual, small, weird, uninteresting or whatever other reason you're hesitating from starting that there PROBABLY IS an audience for it and a way to make money.\n\n&#x200B;\n\n**Here's a few examples that I found on the** [**NicheNirvana.com**](https://NicheNirvana.com) **website (one of many I visit regularly to get my fix of online business ideas) today that I thought stood out as being pretty weird.**\n\nYet all had high organic search traffic levels when I checked them using SEO tool UberSuggest.\n\n**Including one with 2 MILLION visitors per month just from organic search which I'll post at the end and you won't belive how bizzare (and basic) it is!**\n\nBased on the traffic numbers of these sites (although all estimated bt a 3rd party tool) you can assume if accurate it means they make some level of profit with such high traffic levels but I don't have the facts on their revenue so you'd have to do your own estimates on that.\n\n&#x200B;\n\n**Here are the 12 sites...**\n\n**1)** **germanshepherddoghq.com**\n\nIt's literally just a basic blog about nothing but the German Sherperd Breed of Dog.\n\nIt appears to be monetizing via the Amazon Associate (Affiliate) Program and Mediavine Display Ads.\n\nYou could pick any dog breed and create a similar site yourself!\n\n**They get over 79,000 visitors p/m just from search and this is probably a topic that works great on visual social platforms like Facebook, Pinterest, and Insta which can potentially send them more.**\n\n&#x200B;\n\n**2) steeljawlinegum.com**\n\nIt's a website that sells \"jawline exercise tools\" which I didn't know was a thing people needed or wanted to exercise.\n\nThey sell their own physical products including gum and kits.\n\n**But apparently they get over 64,000 visitors per month!**\n\nNot neccessarily an easy business to replicate but it does show you people will buy just about anything IMO.\n\n&#x200B;\n\n**3)** **atticsandmore.com**\n\nIt's literally only a content website that talks about nothing other than attics including the products you might need (ladders, insulation, and vents).\n\nIt appears to mostly make money through the Amazon Affiliate program by promoting the products but they also have a \"find a contractor\" service for different areas of the USA so they may also be selling leads to local businesses.\n\nIt looks like they are getting around **an estimated 35,000+ visitors per month just from organic search** **but that's down from a peak of 153,000+ per month back in March 2022** so they probably got caught up in the endless Google Algorithm updates over the past year or so.\n\nThis is the type of random site anyone could replicate or just pick some other random topic (like a room in your house maybe) and blog about everything related to it, works for this site!\n\n&#x200B;\n\n**4)** **birdfeederhub.com**\n\nIt just blogs about Bird Feeder Hubs and birds.\n\nIt monetizes through Affiliate links to Amazon around Bird Feeding Products in review and comparison guides and uses Mediavine Display Ads in posts too.\n\nI don't get the impression the creator is a bird expert tbh - easily replicable!\n\n**Apparently it gets over 100k visitors p/m just from search.**\n\n&#x200B;\n\n**5)** **cuboss.com**\n\nA site that just sells Rubix Cubes and items to repair them it seems which seems fairly niche considering I've not seen anyone use a Rubix Cube for over 20 years.\n\n**But it's claimed they get 12,000 visitors p/m - not ground breaking but still it seems like a relic of a product so that's not bad.**\n\nAgain, not something easy to just copy but seems like people still buy Rubix Cubes which are oooooold as hell so what else do they buy still...Tamagotchis? Walkmans? Yo Yos?\n\nHonestly, I bet people do!\n\n&#x200B;\n\n**6)** **japanobjects.com**\n\nThis is a store with a blog that writes about Japanese \"objects\" (from clothes to cooking) that they sell in order to drive traffic from search engines then push them over to their eCom store.\n\nThere's also some Display Ads on the site which will bring in further revenue.\n\nAnd I know there is a lot of people obsessed with all things Japan so this one maybe isn't that surprising but their traffic numbers are.\n\n**The SEO tools suggest they get over 100k visitors per month just from organic search and this is a site that probably does well on social media.**\n\n&#x200B;\n\n**7)** **blackenterprise.com**\n\nA website dedicated to business but only aimed at black people it seems.\n\nI'm not clued up enough to know why the advice would be any different from any other business.\n\nThey seem to monetize via various Display Ad networks only and there may be some affiliate offers in there too.\n\nThis site is proof that you can take an already very competitive topic (business) and then cater to a specific demographic / type of person and succeed in that crowded area by appealing only to those people, think about it.\n\n**And apparently get over 284,000 visitors p/m so there's obviously a lot of people looking for specific info on being black and running a business.**\n\n&#x200B;\n\n**8)** **mypizzacorner.com**\n\nIt literally just writes content on Pizza from recipes, to how to cook it and make dough, to reviewing pizza ovens.\n\nThey monetize via the Mediavine Display Ad Network and I see an Amazon Affiliate Disclaimer in the footer too so presumably they review or compare some pizza cooking ovens and related items too.\n\n**They get a whopping (estimated) 88,000+ visitors per month just from organic search plus I see they also are building an email list which if successful will drive more traffic.**\n\nAnd though I can see no sign of social media accounts linked from the website if they are producing recipes for real then making videos for Youtube and TikTok and being on all the visual social channels would work really well to drive more traffic.\n\nI think honestly anyone could create this site or similar - just pick a popular food type and cover every subject under the sun people are Googling, any keyword research tool will tell you.\n\n&#x200B;\n\n**9)** **symbolsandsynchronicity.com**\n\nThis is one of those websites for kookie bat sh\\*t crazy people who genuinely believe numbers and everything else in life has secret meanings and messages for them.\n\nThey monetize using Display Ads.\n\n**Their traffic is \"only\" currently at an estimated 12,000+ visitors p/m just from search but at it's peak in May 2022 they were receiving an estimated 74,000+ visitors p/m.**\n\nSo it looks like a few Google Algorithm Updates probably affected them but this is the type of blog almost anyone with some basic SEO knowledge could destroy because I don't suspect the owner whilst being into the Numerology and Signs stuff has a lot of marketing knowledge, but I could be wrong!\n\n&#x200B;\n\n**10)** **autismcommunitystore.com**\n\nIt's an eCom store that just sells Sensory toys and relaxation tools for kids with Autism.\n\nYou can probably buy most of this stuff on Alibaba for a decent price I imagine (haven't checked).\n\nOr if you wanted to do something similar without actually having to stock products then just create a blog that talks and reviews the items they talk about and use the Amazon Affiliate program to monetize.\n\n**They receive over 49,000+ estimated visitors p/m from search.**\n\n&#x200B;\n\n**11)** **soundbuttonsworld.com** \\- **THIS ONE IS F\\*CKING BIZZARE!**\n\nA collection of buttons you can press that make sounds mostly like buzzer sounds for quizzes etc.\n\nIt looks like they monetize with Google Adsense Ads only from what I can see!\n\n**They get over 421,000 visitors p/m and it's so ugly and basic it's laughable, CAN YOU ACTUALLY BELIEVE IT?!?**\n\nI don't imagine it's hard to create these basic sounds, it will be something that takes seconds in a tool, and I don't know why so many people need / want them, but they do - what other sounds do people want that you could create a site around?\n\n&#x200B;\n\n**12)** **rpgbot.net** \\- **WTF is even going on here with this website?!**\n\nI literally can't even figure out what this website is about or what's going on when I look at it but I assume the RPG stands for \"Role Playing Games\".\n\nBut it's certainly feels very specialist and the \"about\" page does nothing to help me understand much better.\n\nIt's also an ugly as hell, basic, outdated looking website but wait for it...\n\n**...it receives an insane (estimated) 2 MILLION VISITORS PER MONTH JUST FROM SEARCH TRAFFIC!**\n\nThey also appear to be on all the Social Media platforms with mixed success (some accounts have very little followers) but they have their own Sub-Reddit, podcast and a Patreon with 303 members  but I'm none the wiser what you actually get for that membership.\n\nThey say \"the riches are in the niches\" and this proves it to me as as outsider to this world I can't even figure out what's going on or what they are talking about on the website - you have to be hardcore geek to understand this one I believe.\n\n&#x200B;\n\n**So, that's where my day went...**\n\nSo those are the 12 random weird websites I lost a whole day to today studying and dissecting them to figure out what they were doing to suceed, reverse engineering them, and trying to figure out some new business ideas for myself.\n\nI thought I may as well share them here because chances are I'll do nothing with most of them anyway due to the 6,795 other projects I have on the go.\n\nHopefully if nothing else it's shown you that you can start a business, especially a website, around almost anything and there's probably enough people interested in the world for you to make money.\n\nMany of these are just monetizing using Display Ad Networks and Affiliate Marketing with Amazon - not exactly rocket science."
    },
    {
        "post_title": "Buy my million-dollar business ideas?",
        "idea": "Idea Marketplace Platform - An online marketplace where entrepreneurs can sell and buy detailed business plans and startup ideas, complete with documentation, market research, and potential revenue models, all while offering secure transactions and confidentiality through enforced NDAs.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/189lz6s/buy_my_milliondollar_business_ideas/",
        "post_content": "Got a busy life. Already dedicated my life on my current startup so i don't see me ever getting time on working on the other startups that could be acquired for millions. My list contains about 30 ideas and each got docs full of information. Everywhere spanning from social media algorithms to predict whether a post will go viral, to technological ideas that can help school systems. Also a bunch of website ideas that i genuinely believe can generate 8-9 figures if executed correctly.  \n\n\nProposal:If interested, just pm me and offer a dollar amount and then sign a NDA once i confirm."
    },
    {
        "post_title": "3 one-person million dollar online businesses",
        "idea": "Startup Idea: BrowserExtensionMarketplace - An online marketplace that connects developers and users for buying and selling browser extensions with analytics tools for tracking sales and market trends, including features to assist developers in transitioning their popular free extensions into profitable business ventures by implementing premium versions or selling aggregated data.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/18877ap/3_oneperson_million_dollar_online_businesses/",
        "post_content": "Our main business is to discover boring online businesses that makes loads of cash.\n\nRecently, We are doing a series on one-person million dollar online businesses.\n\nI thought this might be interesting for readers of this subreddit.\n\nso far, we have found 3 such businesses, which you may not know yet.\n\n&#x200B;\n\n1. Wappalyzer [https://www.wappalyzer.com](https://www.wappalyzer.com): This one started as a chrome extension, then grew into a one-person million dollar business, the owner makes money by selling data to business associates.\n2. Sidekiq [https://sidekiq.org/](https://sidekiq.org/): This one started as an open source project, once it got enough traction, the developer made a premium version of it, and makes money by selling licenses to businesses.\n3. BuiltWith [https://builtwith.com/](https://builtwith.com/): This is probably the OG in one-person business. It is a by-product of solving his own pain point.\n\n&#x200B;\n\nLet us know if this is interesting and we will share more here."
    },
    {
        "post_title": "(Business ideas) Looking for anyone who has business ideas who will think it will go up the roof but doesn’t have the funds to do it. I’m here to invest in business ideas that I think will become BIG and invest in you.",
        "idea": "Virtual Reality Home Fitness System with Live and AI-Personalized Training Sessions",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/188qxi9/business_ideas_looking_for_anyone_who_has/",
        "post_content": "Drop your comments or private message me"
    },
    {
        "post_title": "Customer Service Is Number One.",
        "idea": "Virtual Customer Service Training Platform with AI-Powered Simulation Scenarios",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/187zqka/customer_service_is_number_one/",
        "post_content": "Before you establish any business, taking care of the customer is number 1. \n\nNow safeguards, and defending your business, and coworkers is extremely important, I am not saying those ever need to be put on the side. That's your shield after all. \n\nBut a good customer experience is everything for them to return, and then from there you are able to grow. \n\nThe customer is the lifeblood. \nNever forget that. \nIf they feel welcomed, and attended to, they will most likely return. \n\nYou will have a bad day, fake the shit out of it until your shift is done, try and get some sleep, and handle what need to be done to have a better day, you blow up at a customer, because they are being an asshole.. Then you lose, and it effects your success. \n\nKeep focused, take care of their issued, and move on with making that money, and giving what the customer needs. \n\nI promise you, if they feel welcomed, they will want to come back, especially if you have what they are looking for. \n\nSo have verity. \n\nBest of luck to your goals."
    },
    {
        "post_title": "How can I turn my hobby into a source of income?",
        "idea": "Personalized Poetry Platform - An online marketplace connecting poets with individuals looking for custom, unique poems for special occasions, gifts, or personal memorabilia. The service includes a system for clients to commission poets for bespoke verses based on specific themes, emotions, or events.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1883i6h/how_can_i_turn_my_hobby_into_a_source_of_income/",
        "post_content": "I've been writing poems for fun for more than 5 years now, and I'm currently 19 years old. Recently, a friend of mine suggested that I consider turning my hobby into a source of income by charging people for personalized poems. I think it's a great idea! Do any of you know where and how I can make that happen?"
    },
    {
        "post_title": "Idea protection & product to market",
        "idea": "Startup idea: IdeaSafe - an online platform providing fully-integrated idea protection services including customizable non-disclosure agreements digital watermarking technology for design files and project collaboration tools designed to track and log contributions from all parties involved ensuring traceable idea ownership and project contribution from inception to market launch for both companies and individuals.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1888oro/idea_protection_product_to_market/",
        "post_content": "Hi,\n\nDoes anyone know the best way to protect my idea and product from the inception?\n\nFor example how can I protect my idea from both paid and unpaid help from friends and freelancers to design a product and brand that I can bring to market?\nThe product cannot be patented.\n\nI understand I can have everyone sign a non disclosure agreement before discussing but does that fully protect me and my product? My concern is that individuals will be generating ideas to design and build a product and brand from scratch that they could later claim to be theirs.\n\nAm I better protected as a company or an individual?\n\nThanks"
    },
    {
        "post_title": "The Prime Minister witnessed the signing ceremony of a memorandum of understanding between the Information Technology Industry Development Authority (ITIDA)",
        "idea": "Digital Governance Solutions Firm specializing in developing and implementing software for government agencies to streamline operations improve citizen engagement and ensure transparency in public sector agreements and initiatives.",
        "post_url": "https://i.redd.it/bl1g68krtn3c1.png",
        "post_content": ""
    },
    {
        "post_title": "Gaming lounge?",
        "idea": "Mobile Gaming Pop-Up Experience",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/187wqhr/gaming_lounge/",
        "post_content": "I’m currently trying to open a gaming lounge/esports club in my local area. I did some research (using Google) to see if there are any competitors and I’ve found one or two places about 45min to an hour away (which is far for anyone who wants to game locally).\n\n I’m just wondering the lack of competition this is a good sign because it’s an untapped market in my local area and I might be able to take advantage of it, or it’s a red flag because it’s too risky?\n\nI also did a local research and the responses are mixed. I want to open this because gaming is my passion so if I were to open this place, if any of you have any tips and advice, they are greatly appreciated! Thank you!"
    },
    {
        "post_title": "Looking For Android App Funding",
        "idea": "EdTech Crowdfunding Platform Specializing in Niche Educational Apps With Equity and Revenue Sharing Options",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1881vzx/looking_for_android_app_funding/",
        "post_content": "Have education( for  Law Students)android app with up 100k download and 37k active user .\n\nمغرب القانون\nhttps://play.google.com/store/apps/details?id=com.newanoir.marco\n\nNow need make update and integrate subscribe system that earn up to 60k $ /3 months with 37k active users . \n\nFunding Needed : 100K $\nFunding Returns  is :\n-  Equity in Company \nOr\n- 20 % subscription incomes per Year .\n\nInvestor can be part of our team if skilled .\nThe app operated in morocco.\n\nThis app is avalible for sale Also .\n\nRegards ."
    },
    {
        "post_title": "Bake sell?",
        "idea": "Personalized Dessert Subscription Box with Added Experiential Perks",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/187relt/bake_sell/",
        "post_content": "Hello everyone I’m just popping in because\nI recently been hit with an unforeseen circumstance I got into a pretty bad car accident on Thanksgiving \n\nSo with that being said, while funds aren’t  too too tight. I do have some things coming up such as school payments/ books \n\nWhat I was wanting to do is sell my desserts for $10 \n\nBut I also feel like I should throw something else in with it to boost more sales\n\nWhat can I add as a bonus for purchasing? What would you guys like?\n\nThank you !"
    },
    {
        "post_title": "I do sell handmade and customized gifts through insta.",
        "idea": "Online Custom Gift Platform with Integrated Artist Marketplace and Cost Calculator",
        "post_url": "https://i.redd.it/zrz0aqpfij3c1.jpeg",
        "post_content": "How to make it a step ahead\n\nIf i will ask to make a website for it, how much it will cost.\nAny idea?\nIt will gonna be a part time business.\nAnyone want to join or wanna give suggestion.\nPlease feel free to dm"
    },
    {
        "post_title": "Building a Business Around Improving Local Businesses",
        "idea": "Digital Toolkit Platform for Small Businesses - A comprehensive SaaS offering that provides local businesses with easy-to-use tools for website enhancement customer engagement automation reputation management and digital booking systems tailored to boost online presence and operational efficiency.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/187nqvb/building_a_business_around_improving_local/",
        "post_content": " Hey everyone! I've been considering diving into a business focused on assisting small/local businesses to amp up their online game – think improved websites, boosted Google reviews, streamlined bookings, and automated communications. I believe it could be incredibly fulfilling to help these businesses grow. \n\nIf any of you have ventured into this arena, I'd love to hear about your experience! What was it like? Any specific resources or tools that proved to be game-changers? I'm all ears for insights and advice! Thanks a ton in advance!  "
    },
    {
        "post_title": "Businesses that seems illegal but completely legal?",
        "idea": "MysteryAudit: A platform offering mystery shopping services with a focus on auditing and reporting businesses that toe the line of legality providing insights and consultancy for both consumer awareness and business compliance.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/186ilka/businesses_that_seems_illegal_but_completely_legal/",
        "post_content": "Ever seen a business you thought should be illegal."
    },
    {
        "post_title": "Does anyone work with consumer spices and herbs, I have a packaging invention and am not sure what to do with it.",
        "idea": "SmartSpice: An innovative spice and herb packaging startup that offers a patented smart container system integrating freshness seals easy-measure dispensers and digital inventory tracking for home cooks and professional chefs.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/187c8ma/does_anyone_work_with_consumer_spices_and_herbs_i/",
        "post_content": "I invented a new packaging for home culinary spices/herbs about 10 years ago and am not sure what to do with it. Does anyone have experience with this? \n\nThank you!"
    },
    {
        "post_title": "gym idea",
        "idea": "SmartPin: A Fitness Tracking Device for Gym Equipment",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1879c2i/gym_idea/",
        "post_content": "As a frequent gym goer it sometimes gets annoying to track reps and weight on the phone. Why not make an attachment that goes onto the pin to track how many reps you do\nand the weight for it. can even add rest periods taken aswell"
    },
    {
        "post_title": "Iron Ore",
        "idea": "Introduce a digital B2B platform to facilitate the trade of raw materials like iron ore by connecting mines with manufacturers and brokers simplifying procurement and trade logistics with added services in compliance verification and transaction management.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/1876wbv/iron_ore/",
        "post_content": "Hey guys,\nI recently went to China to develop relationships with some of the major steel mills. I will be purchasing steel from them sooner or later for one of my clients in my home country (Singapore), currently waiting for POs, material lists, compliance certs etc. After that deal has concluded, I was thinking of using that relationship to broker an iron ore deal for the mill for a commission. I haven’t been deep down this rabbit hole yet, and to be honest I have no idea how this middleman market works. Anyone here with experience? Could you let me know if this idea is even feasible? if it is feasible, we could work together if you have relationships with iron ore mines, hope to hear from you guys soon!"
    },
    {
        "post_title": "idea for personalized digital portrait business",
        "idea": "Personalized Digital Artisan Portraits with AI Collaboration Platform",
        "post_url": "https://www.reddit.com/gallery/1876l0j",
        "post_content": "I make these portraits (digital collages) and was thinking of maybe making a business where people tell me a bit about themselves and I make them personalized portrait. it takes me between 45mins-2hrs to complete portraits like these. i have printed them on canvas before and they look gorgeous. \n\nany ideas/feedback about starting a business like this? how much would you be willing to pay for pieces like these? thanks!"
    },
    {
        "post_title": "The right way?",
        "idea": "AI-driven Digital Marketing and Analytics Platform for Small Businesses",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/186v7w3/the_right_way/",
        "post_content": "Hello everyone,\n\nI operate two businesses: a web design agency and a v34 teeth whitening venture. While the web design agency has garnered some customers, they are primarily acquaintances, resulting in an annual revenue of approximately 1.5k. Despite active promotion on Instagram and meta ads, I struggle to attract new clients.\n\nIn the first month, the teeth whitening business generated 200€ in revenue, solely from ad expenditures, and I continue to run ads today. Unfortunately, neither business is thriving, and the web agency's income is insufficient for it to be considered a successful company.\n\nI recently heard from a friend about someone making substantial profits using AI, particularly with images. Although numerous online courses claim to teach how to profit from AI, I'm skeptical about their credibility. Is anyone else facing a similar situation?"
    },
    {
        "post_title": "Where do I start",
        "idea": "Multilingual E-commerce Marketplace Platform for Buying and Selling Online Businesses tailored for untapped regional markets with built-in translation and localization services.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/186x22y/where_do_i_start/",
        "post_content": "So, I have a business idea not really new but it is basically just copying an existing website and transforming it into a different language for a different region. \n\nThe website is basically for selling e-com businesses. Where do I get started? Should I hire a freelancer?"
    },
    {
        "post_title": "Need Help - Business Opportunity Long Distance Driving",
        "idea": "CrossBorder Haul & Trade Network: A platform that connects individuals and small businesses looking to transport goods with travelers who have available space in their vehicle and are already heading to the destination. This service will focus on long-distance trips especially between countries like the US and Mexico ensuring a cost-effective delivery solution while providing drivers an opportunity to earn money on routes they are already taking.",
        "post_url": "https://www.reddit.com/r/Business_Ideas/comments/186v8n1/need_help_business_opportunity_long_distance/",
        "post_content": "So I frequently (once a month) drive from northern Mexico to Detroit. \n\nI drive by myself. I feel like the drive disconnects my brain, anyhow\n\nI feel like I should take advantage of the space in my small suv to either haul things from Mexico to US and sell, or possibly even a delivery service.\n\nI want to think of something that cash leave me a few extra bucks while I have to make this drive.\n\nMaybe even something like looking for cool and cheap offers near the towns around the highway then sell them in the city or something.\n\nI trying to get other peoples point of view to see if I can come up with something.\n\nI probably only carry 2 bags up front, the back of the rav4 is free for space for deliveries or something, maybe there’s an app someone knows of?\n\nCom’on friends, what do y’all think?"
    }
]